package torti;
/*
 * 1. Да се създаде сладкарница „Сладки таланти“ с пет доставчика с произволни имена.
2. Да се създадат 30 торти с произволни типове и видове, като е възможно от един тип и
от един вид да има повече от една торти. Всяка торта има 25% процента шанс да бъде
от един от четирите описани вида.
3. Да се създадат десет клиента – пет корпоративни и пет частни с произволни имена и
съответните им отстъпки и ваучери.
4. Всеки клиент да направи поръчка на торти и те да му бъдат доставени.
5. Да се изведе на екрана наличността на торти, разписана по видове и типове, преди и
след поръчките.
6. Да се изпише общата сума, получена от сладкарницата, след поръчка на тортите.
7. Да се изведе списък с всички доставчици на сладкарницата, сортиран по големина на
техните бакшиши, като подредбата е от най-богатия към този с най-малко бакшиши.
8. Да се изведе вида торти, който най-често се е продавал.
9. Да се изведе доставчика, направил най-много поръчки.
10. Да се изведе клиентът, който е заплатил най-голяма сума за тортички.
 */
public class Demo {

}
