package torti.lib;

import java.util.HashMap;
import java.util.TreeMap;

/*
 * Сладкарницата съдържа следните характеристики:
• наименование;
• адрес;
• телефон за контакти;
В сладкарницата работят доставчици, които отговарят за доставката на торти.

1. Да се създаде сладкарница „Сладки таланти“ с пет доставчика с произволни имена.
2. Да се създадат 30 торти с произволни типове и видове, като е възможно от един тип и
от един вид да има повече от една торти. Всяка торта има 25% процента шанс да бъде
от един от четирите описани вида.
5. Да се изведе на екрана наличността на торти, разписана по видове и типове, преди и
след поръчките.
6. Да се изпише общата сума, получена от сладкарницата, след поръчка на тортите.
7. Да се изведе списък с всички доставчици на сладкарницата, сортиран по големина на
техните бакшиши, като подредбата е от най-богатия към този с най-малко бакшиши.
8. Да се изведе вида торти, който най-често се е продавал.
 */
public class SweetShop {
	private String name;
	private String adress;
	private String telNumber;
	
//	private HashSet<>
	private HashMap<String,HashMap<String,TreeMap<Cake,Integer>>> torti;
	
}
